<?php
//+-------------------------------------------------------------
//| 
//+-------------------------------------------------------------
//| Author Liu LianSen <liansen@d3zz.com> 
//+-------------------------------------------------------------
//| Date 2017-09-14
//+-------------------------------------------------------------
namespace  api\traits;

trait Success
{
    protected $success = false;

    /**
     * 检查是否调用成功并且符合预期结果
     * @return bool
     */
    public function success()
    {
        return $this->success;
    }

}